_Rarzrabotki/Rarus/USO2/DataProcessors/уатОчисткаИстории.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>уатОчисткаИстории</Name>
			<Comment>Очистка истории ТС</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/уатПробегРасходПоМониторингу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>уатПробегРасходПоМониторингу</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяРаботыДвигателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеОдометра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/уатДополнительныеСведенияПоGPS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>уатДополнительныеСведенияПоGPS</Name>
			<Comment>Дополнительные сведения транспортных средств по данным системы спутникового мониторинга</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДлительностьСобытия</Name>
					<Comment>Длительность события</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельноеЗначение</Name>
					<Comment>Предельное значение</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Comment>Транспортное средство</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Comment>Тип события</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатТипСобытияGPS</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/уатКоординатыПоМониторингу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>уатКоординатыПоМониторингу</Name>
			<Comment>История местоположения транспортных средств по данным системы спутникового мониторинга (GPS)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>17</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>17</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Скорость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/уатОчисткаИстории/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("флДополнительныеСведенияПоGPS", флДополнительныеСведенияПоGPS);
	Параметры.Свойство("флПробегРасходПоМониторингу",   флПробегРасходПоМониторингу);
	Параметры.Свойство("флКоординатыПоМониторингу",     флКоординатыПоМониторингу);
	
	Если Не Константы.уатИспользоватьМониторинг.Получить() Тогда 
		флДополнительныеСведенияПоGPS = Ложь;
		флКоординатыПоМониторингу = Ложь;
		флПробегРасходПоМониторингу = Ложь;
		
		Элементы.флДополнительныеСведенияПоGPS.Видимость = Ложь;
		Элементы.флКоординатыПоМониторингу.Видимость = Ложь;
		Элементы.флПробегРасходПоМониторингу.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.уатДополнительныеСведенияПоGPS) Тогда 
		флДополнительныеСведенияПоGPS = Ложь;
		Элементы.флДополнительныеСведенияПоGPS.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.уатКоординатыПоМониторингу) Тогда 
		флКоординатыПоМониторингу = Ложь;
		Элементы.флКоординатыПоМониторингу.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.уатПробегРасходПоМониторингу) Тогда 
		флПробегРасходПоМониторингу = Ложь;
		Элементы.флПробегРасходПоМониторингу.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблТС

&НаКлиенте
Процедура ТаблТСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Состояние(НСтр("ru = 'Добавлено ТС'") + " <" + Строка(ВыбранноеЗначение) + ">",,, БиблиотекаКартинок.Информация32);
	
	НайдСтроки = ТаблТС.НайтиСтроки(Новый Структура("Ссылка", ВыбранноеЗначение));
	Если НайдСтроки.Количество() = 0 Тогда 
		НовСтрока = ТаблТС.Добавить();
		НовСтрока.Ссылка = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОчиститьИсторию(Команда)
	
	Если Не ЗначениеЗаполнено(ПериодПо) Тогда 
		ТекстОшибки = НСтр("en='It is necessary to specify expiry date of cleaning period.';ru='Необходимо указать дату окончания периода очистки.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "ПериодПо");
		Возврат;
	КонецЕсли;
	
	Если ПериодС > ПериодПо Тогда 
		ТекстОшибки = НСтр("en='Begin date of clean period cannot be greater than end date.';ru='Дата начала периода очистки не может быть больше даты окончания.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "ПериодС");
		Возврат;
	КонецЕсли;
	
	Если Не флДополнительныеСведенияПоGPS И Не флПробегРасходПоМониторингу И Не флКоординатыПоМониторингу Тогда 
		ТекстОшибки = НСтр("ru = 'Необходимо выбрать регистры для очистки'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Если ТаблТС.Количество() Тогда 
		ТекстВопроса = НСтр("ru = 'Будут удалены данные по указанным ТС в выбранных регистрах за период. Операция может занять длительное время. Продолжить?'");
	Иначе 
		ТекстВопроса = НСтр("ru = 'Будут удалены все данные в выбранных регистрах за период. Операция может занять длительное время. Продолжить?'");
	КонецЕсли;
	
	ПоказатьВопрос(
		Новый ОписаниеОповещения("ОчиститьИсториюПослеОтвета", ЭтотОбъект),
		ТекстВопроса,
		РежимДиалогаВопрос.ДаНет,
		,
		,
		НСтр("ru='Очистка данных'")
	);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериода(Команда)
	
	ДиалогПериода = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогПериода.Период.ДатаНачала = ПериодС;
	ДиалогПериода.Период.ДатаОкончания = ПериодПо;
	ДиалогПериода.Показать(Новый ОписаниеОповещения("НастройкаПериодаЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьТС(Команда)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Справочник.ТранспортныеСредства.ФормаВыбора", ПараметрыФормы, Элементы.ТаблТС,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсемиТС(Команда)
	
	Если ТаблТС.Количество() Тогда 
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ЗаполнитьВсемиТСОчистка", ЭтотОбъект),
			НСтр("en='You want to clear the table before filling?';ru='Очистить таблицу перед заполнением?'"),
			РежимДиалогаВопрос.ДаНетОтмена
		);
		
	Иначе 
		ЗаполнитьВсемиТСЗавершение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасширенноеЗаполнение(Команда)
	
	Если ТаблТС.Количество() Тогда 
		ПоказатьВопрос(
			Новый ОписаниеОповещения("РасширенноеЗаполнениеОчистка", ЭтотОбъект),
			НСтр("en='You want to clear the table before filling?';ru='Очистить таблицу перед заполнением?'"),
			РежимДиалогаВопрос.ДаНетОтмена
		);
		
	Иначе 
		РасширенноеЗаполнениеУстановитьОтбор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицуТС(Команда)
	
	Если ТаблТС.Количество() Тогда 
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ОчиститьТаблицуТСОчистка", ЭтотОбъект),
			НСтр("en='You want to clear the table?';ru='Очистить таблицу?'"),
			РежимДиалогаВопрос.ДаНет
		);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастройкаПериодаЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПериодС  = Период.ДатаНачала;
	ПериодПо = Период.ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИсториюПослеОтвета(Результат, ДопПараметры) Экспорт
	
	Если Не Результат = КодВозвратаДиалога.Да Тогда 
		Возврат;
	КонецЕсли;
	
	Состояние(НСтр("ru='Очистка данных ...'"));
	
	мсвТС = Новый Массив();
	Для Каждого ТекСтрока Из ТаблТС Цикл 
		мсвТС.Добавить(ТекСтрока.Ссылка);
	КонецЦикла;
	
	РезультатУспешно = Истина;
	
	Если РезультатУспешно И флДополнительныеСведенияПоGPS Тогда 
		РезультатУспешно = ОчисткаДополнительныхСведенийПоGPS(ПериодС, ПериодПо, мсвТС);
	КонецЕсли;
	
	Если РезультатУспешно И флКоординатыПоМониторингу Тогда 
		РезультатУспешно = ОчисткаКоординатПоМониторингу(ПериодС, ПериодПо, мсвТС);
	КонецЕсли;
	
	Если РезультатУспешно И флПробегРасходПоМониторингу Тогда 
		РезультатУспешно = ОчисткаПробегаРасходаПоМониторингу(ПериодС, ПериодПо, мсвТС);
	КонецЕсли;
	
	Если РезультатУспешно Тогда 
		ПоказатьПредупреждение(, НСтр("ru='Очистка данных выполнена успешно.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОчисткаПробегаРасходаПоМониторингу(Знач ДатаС, Знач ДатаПо, Знач МассивТС)
	
	ЗаписатьЛогВЖурналРегистрации(
		НСтр("ru = 'пробега и расхода по мониторингу'"),
		ДатаС, 
		ДатаПо,
		МассивТС
	);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаС",     ДатаС);
	Запрос.УстановитьПараметр("ДатаПо",    ДатаПо);
	Запрос.УстановитьПараметр("МассивТС",  МассивТС);
	Запрос.УстановитьПараметр("ОтборПоТС", МассивТС.Количество() <> 0);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПробегРасходПоМониторингу.Период КАК Период,
	|	уатПробегРасходПоМониторингу.ТС КАК ТС
	|ИЗ
	|	РегистрСведений.уатПробегРасходПоМониторингу КАК уатПробегРасходПоМониторингу
	|ГДЕ
	|	уатПробегРасходПоМониторингу.Период МЕЖДУ &ДатаС И &ДатаПо
	|	И ВЫБОР
	|			КОГДА &ОтборПоТС
	|				ТОГДА уатПробегРасходПоМониторингу.ТС В (&МассивТС)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НаборЗаписей = РегистрыСведений.уатПробегРасходПоМониторингу.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.Отбор.ТС.Установить(Выборка.ТС);
		
		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // ОчисткаПробегаРасходаПоМониторингу()

&НаСервере
Функция ОчисткаДополнительныхСведенийПоGPS(Знач ДатаС, Знач ДатаПо, Знач МассивТС)
	
	ЗаписатьЛогВЖурналРегистрации(
		НСтр("ru = 'дополнительных сведений ТС по GPS'"),
		ДатаС, 
		ДатаПо,
		МассивТС
	);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаС",     ДатаС);
	Запрос.УстановитьПараметр("ДатаПо",    ДатаПо);
	Запрос.УстановитьПараметр("МассивТС",  МассивТС);
	Запрос.УстановитьПараметр("ОтборПоТС", МассивТС.Количество() <> 0);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатДополнительныеСведенияПоGPS.Период КАК Период,
	|	уатДополнительныеСведенияПоGPS.ТС КАК ТС,
	|	уатДополнительныеСведенияПоGPS.ТипСобытия КАК ТипСобытия
	|ИЗ
	|	РегистрСведений.уатДополнительныеСведенияПоGPS КАК уатДополнительныеСведенияПоGPS
	|ГДЕ
	|	уатДополнительныеСведенияПоGPS.Период МЕЖДУ &ДатаС И &ДатаПо
	|	И ВЫБОР
	|			КОГДА &ОтборПоТС
	|				ТОГДА уатДополнительныеСведенияПоGPS.ТС В (&МассивТС)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НаборЗаписей = РегистрыСведений.уатДополнительныеСведенияПоGPS.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.Отбор.ТС.Установить(Выборка.ТС);
		НаборЗаписей.Отбор.ТипСобытия.Установить(Выборка.ТипСобытия);
		
		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // ОчисткаДополнительныхСведенийПоGPS()

&НаСервере
Функция ОчисткаКоординатПоМониторингу(Знач ДатаС, Знач ДатаПо, Знач МассивТС)
	
	ЗаписатьЛогВЖурналРегистрации(
		НСтр("ru = 'координат по мониторингу'"),
		ДатаС, 
		ДатаПо,
		МассивТС
	);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаС",     ДатаС);
	Запрос.УстановитьПараметр("ДатаПо",    ДатаПо);
	Запрос.УстановитьПараметр("МассивТС",  МассивТС);
	Запрос.УстановитьПараметр("ОтборПоТС", МассивТС.Количество() <> 0);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатКоординатыПоМониторингу.Период КАК Период,
	|	уатКоординатыПоМониторингу.ТС КАК ТС
	|ИЗ
	|	РегистрСведений.уатКоординатыПоМониторингу КАК уатКоординатыПоМониторингу
	|ГДЕ
	|	уатКоординатыПоМониторингу.Период МЕЖДУ &ДатаС И &ДатаПо
	|	И ВЫБОР
	|			КОГДА &ОтборПоТС
	|				ТОГДА уатКоординатыПоМониторингу.ТС В (&МассивТС)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НаборЗаписей = РегистрыСведений.уатКоординатыПоМониторингу.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.Отбор.ТС.Установить(Выборка.ТС);
		
		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // ОчисткаКоординатПоМониторингу()

&НаКлиенте
Процедура ЗаполнитьВсемиТСОчистка(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		ТаблТС.Очистить();
		ЗаполнитьВсемиТСЗавершение();
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда 
		ЗаполнитьВсемиТСЗавершение();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсемиТСЗавершение()
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТранспортныеСредства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТранспортныеСредства КАК ТранспортныеСредства
	|ГДЕ
	|	НЕ ТранспортныеСредства.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НовСтрока = ТаблТС.Добавить();
		НовСтрока.Ссылка = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РасширенноеЗаполнениеОчистка(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		ТаблТС.Очистить();
		РасширенноеЗаполнениеУстановитьОтбор();
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда 
		РасширенноеЗаполнениеУстановитьОтбор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасширенноеЗаполнениеУстановитьОтбор()
	
	ОткрытьФорму(
		"ОбщаяФорма.уатФормаПодбораТС", 
		Новый Структура("ИсточникПодбора", "Обработка_уатОчисткаИстории"), 
		ЭтотОбъект,
		,
		,
		,
		Новый ОписаниеОповещения("РасширенноеЗаполнениеЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Процедура РасширенноеЗаполнениеЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекТС Из РезультатЗакрытия Цикл 
		НовСтрока = ТаблТС.Добавить();
		НовСтрока.Ссылка = ТекТС;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицуТСОчистка(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		ТаблТС.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЛогВЖурналРегистрации(Знач ИмяИсточникаДанных, Знач ДатаС, Знач ДатаПо, Знач МассивТС)
	
	Если МассивТС.Количество() = 0 Тогда 
		ПредставлениеТС = НСтр("ru = 'всем ТС'");
	Иначе 
		СтрокаТС = "";
		Для Каждого ТекТС Из МассивТС Цикл 
			СтрокаТС = СтрокаТС + ?(СтрокаТС = "", "", ", ") + Строка(ТекТС);
		КонецЦикла;
		ПредставлениеТС = НСтр("ru = 'ТС:'") + " " + СтрокаТС;
	КонецЕсли;
	
	ТекстШаблона = НСтр("ru = 'Выполнена очистка'") + " %1 " + НСтр("ru = 'по'")
		+ " %2 " + НСтр("ru = 'за период с'") + " %3 " + НСтр("ru = 'по'") + " %4";
	
	ТекстЛога = СтрШаблон(ТекстШаблона, ИмяИсточникаДанных, ПредставлениеТС, Строка(ДатаС), Строка(ДатаПо));
	
	ЗаписьЖурналаРегистрации(
		"Очистка истории",
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Обработки.уатОчисткаИстории,
		,
		ТекстЛога
	);
	
КонецПроцедуры

#КонецОбласти
